results/results_c5_large/results_c5_large_run2/oltp_read_only_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 84.19 qps: 1349.06 (r/w/o: 1180.39/0.00/168.67) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 84.60 qps: 1354.44 (r/w/o: 1185.14/0.00/169.31) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 84.30 qps: 1350.10 (r/w/o: 1181.50/0.00/168.60) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 85.40 qps: 1365.50 (r/w/o: 1194.70/0.00/170.80) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 76.50 qps: 1225.30 (r/w/o: 1072.30/0.00/153.00) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 84.80 qps: 1355.70 (r/w/o: 1186.10/0.00/169.60) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 84.80 qps: 1357.10 (r/w/o: 1187.50/0.00/169.60) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 85.30 qps: 1364.90 (r/w/o: 1194.30/0.00/170.60) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 80.00 qps: 1277.80 (r/w/o: 1117.80/0.00/160.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 84.70 qps: 1356.20 (r/w/o: 1186.80/0.00/169.40) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 85.00 qps: 1359.99 (r/w/o: 1189.99/0.00/170.00) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 84.10 qps: 1346.30 (r/w/o: 1178.10/0.00/168.20) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            140574
        write:                           0
        other:                           20082
        total:                           160656
    transactions:                        10041  (83.65 per sec.)
    queries:                             160656 (1338.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      83.6535
    time elapsed:                        120.0309s
    total number of events:              10041

Latency (ms):
         min:                                   15.50
         avg:                                   47.81
         max:                                  232.58
         95th percentile:                       92.42
         sum:                               480060.62

Threads fairness:
    events (avg/stddev):           2510.2500/14.22
    execution time (avg/stddev):   120.0152/0.01